Gregification/BeeMS/MB_MSPM0G3507_A/src/Tasks/task_ethModbus.cpp
/*
 * fiddle.cpp
 *
 *  Created on: Jun 6, 2025
 *      Author: FSAE
 *
 *  This task is the interface with RapidSCADA.
 *  Achieved by a Modbus-TCP connection through the W5500.
 *
 *  RESOURCES:
 *      - Modbus-TCP : https://www.prosoft-technology.com/kb/assets/intro_modbustcp.pdf
 *          - TLDR: its just Modbus-RTU but sent over TCP
 *          - doc has a LOT of info. see Modbus-RTU doc for more on relevant stuff
 *          - "Modbus TCP/IP (also Modbus-TCP) is simply the Modbus RTU protocol
 *              with a TCP interface that runs on Ethernet." /4
 *      - Modbus-RTU : https://www.modbustools.com/modbus.html
 *          - doc has too-d-point packet breakdown
 *
 * - in the name of professor Microwave, we will put all the code in one function
 * - probably reentrant but i wouldn't find out. easier to add-on multi-socket support
 *      if thats what your looking at.
 */

/*
 * TODO: look at later : https://www.tij.co.jp/jp/lit/ml/slyp847/slyp847.pdf
 */

#include <Core/Networking/ModbusRegisters.hpp>
#include <cstdint>
#include <FreeRTOS.h>
#include <task.h>
#include <ti/driverlib/driverlib.h>
#include <Tasks/task_ethModbus.hpp>

#include "Core/system.hpp"
#include "Core/MasterBoard.hpp"
#include "Core/std alternatives/string.hpp"
#include "Core/Networking/Modbus.hpp"
#include "Core/Networking/bridge_CAN_Modbus.hpp"
#include "Middleware/W5500/socket.h"
#include "Middleware/W5500/wizchip_conf.h"


/*** setup ***************************************************/
System::UART::UART &            uart = System::UART::uart_ui;

/*** CAN ***************/
System::CANFD::CANFD &          can = System::CANFD::canFD0;

/*** wizchip setup ****/
System::SPI::SPI &              wiz_spi   = MstrB::Eth::spi;
System::GPIO::GPIO const &      wiz_cs    = MstrB::Eth::cs;
System::GPIO::GPIO const &      wiz_reset = MstrB::Eth::reset;
//System::SPI::SPI &              wiz_spi   = System::SPI::spi1;
//System::GPIO::GPIO const &      wiz_cs    = System::GPIO::PB3;
//System::GPIO::GPIO const &      wiz_reset = System::GPIO::PB2;
//System::SPI::SPI &              wiz_spi   = System::SPI::spi0; // workie
//System::GPIO::GPIO const &      wiz_cs    = System::GPIO::PA15;
//System::GPIO::GPIO const &      wiz_reset = System::GPIO::PB14;
uint16_t const                  modbusTCPPort = 502;   // arbitrary, must match RapidSCADA connection settings

uint8_t                         sockets[] = {0,1,2,3};

wiz_NetInfo netConfig = {
           .mac = {0xBE,0xEE,0xEE,0x00,0x00,0x00}, // arbitrary
//           .ip  = {192,168,1,2},
//           .sn  = {255,255,255,0},
           .ip  = {169,254,0,1},
           .sn  = {255,255,0,0},
           .gw  = {192,168,1,1},
           .dns = {8,8,8,8},
           .dhcp= NETINFO_STATIC
    };


/*************************************************************/

union _RXBuffer {
    Networking::Modbus::MBAPHeader mbap;
    DL_MCAN_RxBufElement canrx;

    uint8_t arr[Networking::Bridge::CANModbus::PKTBUFFSIZE]; // 260B MAX standard Modbus-TCP len (MBAP + PDU), we can get away with smaller for 99% of stuff
};
static_assert(sizeof(_RXBuffer) <= UINT16_MAX);

union _TXBuffer {
    Networking::Modbus::MBAPHeader mbap;
    DL_MCAN_TxBufElement cantx;

    uint8_t arr[Networking::Bridge::CANModbus::PKTBUFFSIZE]; // see comment above. idk. what do u want from me. go find the campus cat. ("mmmm" (Microwave imitation))
};
static_assert(sizeof(_TXBuffer) <= UINT16_MAX);


/** returns true on success */
bool setupWizchip();
/** prints human readable meaning of socket error code */
void wiz_print_sockerror(int8_t error);

bool forwardModbusTCP2CAN(_RXBuffer const * rxbuff, _TXBuffer * txbuff, uint8_t socket);


void checkSocket(uint8_t socket, _RXBuffer * rxb, _TXBuffer * txb);
void checkCAN(_RXBuffer * rxb, _TXBuffer * txb);

/*** main ****************************************************/

void Task::ethModbus_task(void *){
    uart.nputs(ARRANDN("ethModbus_task start" NEWLINE));
    _RXBuffer rxbuf = {0};
    _TXBuffer txbuf = {0};

    wiz_spi.setSCLKTarget(32e6);

    /*** W5500 init *****************/

    uart.nputs(ARRANDN(CLIHIGHLIGHT "awaiting W5500 response ..." CLIRESET NEWLINE));
    while(!setupWizchip()) {
        uart.nputs(ARRANDN(CLIERROR "non-fatal: W5500 init failed! retrying..." CLIRESET NEWLINE));
        vTaskDelay(pdMS_TO_TICKS(1000));
    }

    wizchip_setnetinfo(&netConfig);
    {
        wiz_NetTimeout timeout = {
               .retry_cnt = 3,
               .time_100us = 1500,
            };
        wizchip_settimeout(&timeout);
    }


    {
        for(int i = 0; i < sizeof(sockets)/sizeof(sockets[0]); i++){
            vTaskDelay(pdMS_TO_TICKS(10));
            disconnect(sockets[i]);
            close(sockets[i]);
        }
    }

    /********************************/
    {
        wiz_NetInfo read;
        uart.nputs(ARRANDN(CLIRESET "reading back net config ... " NEWLINE));
        wizchip_getnetinfo(&read);

        while(!ALT::memcmp(&read, &netConfig, sizeof(netConfig))) {
            uart.nputs(ARRANDN(CLIRESET CLIERROR "W5500" CLINO " read" CLIERROR " config does not match" CLIYES " written" NEWLINE));

            uart.nputs(ARRANDN(CLIYES "IP: \t"));
            for(int i = 0; i < 4; i++){
                uart.putu32d(netConfig.ip[i]);
                uart.nputs(ARRANDN("."));
            }
            uart.nputs(ARRANDN(NEWLINE "SNM: \t"));
            for(int i = 0; i < 4; i++){
                uart.putu32d(netConfig.sn[i]);
                uart.nputs(ARRANDN("."));
            }
            uart.nputs(ARRANDN(NEWLINE "MAC: \t"));
            for(int i = 0; i < 6; i++){
                uart.putu32h(netConfig.mac[i]);
                uart.nputs(ARRANDN(" "));
            }

            uart.nputs(ARRANDN(CLINO NEWLINE));

            uart.nputs(ARRANDN("IP: \t"));
            for(int i = 0; i < 4; i++){
                uart.putu32d(read.ip[i]);
                uart.nputs(ARRANDN("."));
            }
            uart.nputs(ARRANDN(NEWLINE "SNM: \t"));
            for(int i = 0; i < 4; i++){
                uart.putu32d(read.sn[i]);
                uart.nputs(ARRANDN("."));
            }
            uart.nputs(ARRANDN(NEWLINE "MAC: \t"));
            for(int i = 0; i < 6; i++){
                uart.putu32h(read.mac[i]);
                uart.nputs(ARRANDN(" "));
            }


            wizchip_sw_reset();
            if(0 != wizchip_init(NULL,NULL))
                uart.nputs(ARRANDN("W5500 failed to reinit D:" NEWLINE)); // uh oh
            vTaskDelay(pdMS_TO_TICKS(1000));
            wizchip_getnetinfo(&read);
            uart.nputs(ARRANDN(NEWLINE));
        }

