Gregification/BeeMS/MB_MSPM0G3507_A/src/Tasks/task_ethModbus.cpp
        uart.nputs(ARRANDN(CLIRESET NEWLINE CLIHIGHLIGHT"IP: \t"));
        for(int i = 0; i < 4; i++){
            uart.putu32d(read.ip[i]);
            uart.nputs(ARRANDN("."));
        }
        uart.nputs(ARRANDN(NEWLINE "SNM: \t"));
        for(int i = 0; i < 4; i++){
            uart.putu32d(read.sn[i]);
            uart.nputs(ARRANDN("."));
        }
        uart.nputs(ARRANDN(NEWLINE "MAC: \t"));
        for(int i = 0; i < 6; i++){
            uart.putu32h(read.mac[i]);
            uart.nputs(ARRANDN(" "));
        }

        uart.nputs(ARRANDN(CLIRESET NEWLINE));
    }

    // broadcast to ensure device is known to network equipment
    {
        SOCKET s = sockets[0];
        int8_t error = socket(s, Sn_MR_UDP, 123, SF_IO_NONBLOCK);
        if(error == s) {
            uint8_t addr[4];
            ALT::memcpy(netConfig.ip, addr, sizeof(addr));
            addr[3] = 255;
            sendto(s, addr, 1, addr, 1234);
        }
        close(s);
    }

    while(true) {
        for(uint8_t i = 0; i < sizeof(sockets)/sizeof(sockets[0]); i++){
            checkSocket(sockets[i], &rxbuf, &txbuf);
        }
        checkCAN(&rxbuf, &txbuf);
    }

    /********************************/
    /* we just wait for a connection, only support single connection.
     * 1. init socket
     * 2. setup socket to listen for incoming tcp
     * 3. wait for incoming connection
     * 4. receive packet
     * 5. process or forward request
     * 6(7). if necessary, transmit back data
     * 7. go to step 4
     *
     * - to add support for multiple connections just make more sockets.
     * - if a error happens reset connection and restart from step one
     */


    System::FailHard("ethModbus_task ended" NEWLINE);
    vTaskDelete(NULL);
}

void checkSocket(uint8_t sn, _RXBuffer * rxbuf, _TXBuffer * txbuf){
    if(sn > 8) // W5500 hardware limit
        return;

    switch(getSn_SR(sn)) {
        case SOCK_CLOSED: {
            // open socket as listening tcp

            int8_t error;
            switch(error = socket(sn, Sn_MR_TCP, modbusTCPPort, SF_IO_NONBLOCK)){
                default:
                    if(error == sn) {
//                        uart.nputs(ARRANDN("IP socket inited:"));
//                        uart.put32d(sn);
//                        uart.nputs(ARRANDN(NEWLINE));

                        if(SOCK_OK == listen(sn)) {
                            // yippie
                            uart.nputs(ARRANDN("IP socket listening:"));
                            uart.put32d(sn);
                            uart.nputs(ARRANDN(NEWLINE));
                            break;
                        } else {
                            uart.nputs(ARRANDN("IP inited socket not OK:"));
                            uart.put32d(sn);
                            uart.nputs(ARRANDN(NEWLINE));
                            break;
                        }
                    }

                    uart.nputs(ARRANDN("W5500 unknown response to initing socket!:"));
                    uart.put32d(sn);
                    uart.nputs(ARRANDN(NEWLINE));
                    break;

                case SOCKERR_SOCKMODE:
                case SOCKERR_SOCKFLAG:
                case SOCKERR_SOCKNUM:
                    // failed to init socket, retry
                    uart.nputs(ARRANDN(CLIERROR "Modbus TCP: failed to init socket : " ));
                    wiz_print_sockerror(error);
                    uart.nputs(ARRANDN(CLIRESET NEWLINE));
                    close(sn);
                    break;
            }
        } break;

        case SOCK_ESTABLISHED: {
            // rx ModbusTCP packet
            int32_t status = recv(sn, ARRANDN(rxbuf->arr));
            if(status == 0) return;
            switch(status){
                case SOCK_BUSY:
                    return;
                case SOCKERR_DATALEN:
                    uart.nputs(ARRANDN(CLIWARN "Modbus: zero data length" CLIRESET NEWLINE));
                    close(sn);
                    return;
                case SOCKERR_SOCKNUM:
                    uart.nputs(ARRANDN(CLIWARN "Modbus: Invalid socket number" CLIRESET NEWLINE));
                    close(sn);
                    return;
                case SOCKERR_SOCKMODE:
                    uart.nputs(ARRANDN(CLIWARN "Modbus: Invalid operation in the socket" CLIRESET NEWLINE));
                    close(sn);
                    return;
                case SOCKERR_SOCKSTATUS:
                    uart.nputs(ARRANDN(CLIWARN "Modbus: Invalid socket status for socket operation" CLIRESET NEWLINE));
                    close(sn);
                    return;
                default:
                    if(status >= 0 && status <= sizeof(rxbuf->arr)){
                        // yippie
//                        uart.nputs(ARRANDN("ModbusTCP received on socket #:"));
//                        uart.put32d(sn);
//                        uart.nputs(ARRANDN(NEWLINE));
                        break;
                    }

                    uart.nputs(ARRANDN(CLIERROR "Modbus: unknown receive status!? -> "));
                    uart.put32d(status);
                    uart.nputs(ARRANDN(CLIERROR " on socket "));
                    uart.put32d(sn);
                    uart.nputs(ARRANDN(CLIRESET NEWLINE));
                    return;
            }


            /*** handle packet **************************************/

            using namespace Networking::CAN;
            using namespace Networking::Modbus;
            using namespace Networking::Bridge::CANModbus;

            uint16_t const rxlen = status;
            void const * const rxend = (void*)(rxbuf->arr + rxlen);
            MBAPHeader const * rxheader = &rxbuf->mbap;
            ADUPacket const * rxadu     = rxheader->adu;
            MBAPHeader * txheader       = &txbuf->mbap;
            ADUPacket * txadu           = txheader->adu;


            /*** validation *****************/

            if(rxadu >= rxend) // is under sized?
                break; // ignore packet

            if(ntoh16(rxheader->protocolID) != MBAPHeader::PROTOCOL_ID_MODBUS) // is protocol not Modbus ?
                break; // ignore packet


            /*** process packet *************/

            switch(rxbuf->mbap.adu->func) {
                case Networking::Modbus::Function::W_COIL:
//                    uart.nputs(ARRANDN("W_COIL" NEWLINE));
                    break;

                case Networking::Modbus::Function::W_COILS:
//                    uart.nputs(ARRANDN("W_COILS" NEWLINE));
                    break;

                case Networking::Modbus::Function::W_REG:
//                    uart.nputs(ARRANDN("W_REG" NEWLINE));
                    break;

                case Networking::Modbus::Function::W_REGS:
//                    uart.nputs(ARRANDN("W_REGS" NEWLINE));
                    break;

                case Networking::Modbus::Function::R_COILS:
                case Networking::Modbus::Function::R_DISRETE_INPUTS:
                case Networking::Modbus::Function::R_HOLDING_REGS:
                case Networking::Modbus::Function::R_INPUT_REGS:
//                    uart.nputs(ARRANDN("R_" NEWLINE));
                    break;
                default:
//                    uart.nputs(ARRANDN("D_" NEWLINE));
                    break;
            }

//            if(rxbuf->mbap.adu->func == Networking::Modbus::Function::W_COIL)
//            {
//                uart.nputs(ARRANDN(NEWLINE " \tReceived Eth Modbus: "));
//
//                for(uint8_t j = 0; j < sizeof(rxbuf->mbap) + ntoh16(rxbuf->mbap.len); j++){
//                    if(j % 10 == 0)
//                        uart.nputs(ARRANDN(NEWLINE " \t"));
//
//                    uart.nputs(ARRANDN(" "));
//                    uart.putu32h(((uint8_t *)&rxbuf->mbap)[j]);
//                }
//                uart.nputs(ARRANDN(NEWLINE));
//            }

