Gregification/BeeMS/MB_MSPM0G3507_A/src/Tasks/task_ethModbus.cpp
            // is NOT intended for this device?
            if(rxheader->adu[0].unitID != MstrB::getUnitBoardID() && rxheader->adu[0].unitID != 0) {
                //  forward packet over CAN to intended device
//                uart.nputs(ARRANDN("\t forwarded to CAN bus." NEWLINE));
                if(forwardModbusTCP2CAN(rxbuf, txbuf, sn)) {
//                    uart.nputs(ARRANDN("\tforward: success" NEWLINE));
                } else {
//                    uart.nputs(ARRANDN("\tModbusTCP -> CAN . FAILED . targUID:"));
//                    uart.putu32h(rxheader->adu[0].unitID);
//                    uart.nputs(ARRANDN(NEWLINE));
                }
            }
            else if(ProcessRequest(rxheader, sizeof(rxbuf->arr), txheader, sizeof(txbuf->arr))) {
//                if(rxbuf->mbap.adu->func == Networking::Modbus::Function::W_COIL)
//                {
//                    uart.nputs(ARRANDN(NEWLINE " \tTX Modbus response: "));
//
//                    for(uint8_t j = 0; j < sizeof(txbuf->mbap) + ntoh16(txbuf->mbap.len); j++){
//                        if(j % 10 == 0)
//                            uart.nputs(ARRANDN(NEWLINE " \t"));
//
//                        uart.nputs(ARRANDN(" "));
//                        uart.putu32h(((uint8_t *)&txbuf->mbap)[j]);
//                    }
//                    uart.nputs(ARRANDN(NEWLINE));
//                }
//                uart.nputs(ARRANDN("processed request, sending response" NEWLINE));
                send(sn, txbuf->arr, sizeof(MBAPHeader) + ntoh16(txbuf->mbap.len));
            } else {
                uart.nputs(ARRANDN("failed to process request" NEWLINE));
            }


        } break;

        case SOCK_LISTEN:
//            uart.nputs(ARRANDN("SOCK_LISTEN" NEWLINE));
            break;

        case SOCK_TIME_WAIT:
//            uart.nputs(ARRANDN("SOCK_TIME_WAIT" NEWLINE));
            break;

        case SOCK_FIN_WAIT:
        case SOCK_CLOSING:
        case SOCK_LAST_ACK:
        case SOCK_CLOSE_WAIT:
//            uart.nputs(ARRANDN("SOCK_CLOSE_WAIT" NEWLINE));
            // the W5500 still ACK's keep alive packets in this state,
            //      rapid scada will keep sending them,
            //      the w5500 will report to the mcu the socket is closed,
            //      rapid scada will keep thinking hte socket is still in use
            //      it will get stuck in that loop.
            disconnect(sn);
            close(sn);
            break;

        case SOCK_SYNRECV:
//            uart.nputs(ARRANDN("SOCK_SYNRECV" NEWLINE));
            break;

        case SOCK_SYNSENT:
//            uart.nputs(ARRANDN("SOCK_SYNSENT" NEWLINE));
            break;

        default:
//            uart.nputs(ARRANDN("DEFAULT" NEWLINE));
            disconnect(sn);
            close(sn);
            break;
    }

}

void checkCAN(_RXBuffer * rxbuf, _TXBuffer * txbuf) {
    // make life simple
    using namespace Networking::CAN;
    using namespace Networking::Modbus;
    using namespace Networking::Bridge::CANModbus;

    // CAN -> ModbusTCP

    if(!can.takeResource(pdMS_TO_TICKS(30)))
        return;

    DL_MCAN_RxFIFOStatus rf = {.num = System::CANFD::MODBUS_RXFIFO};
    DL_MCAN_getRxFIFOStatus(can.reg, &rf);

    for(uint32_t i = rf.fillLvl; i != 0; i--) {
        if(rf.fillLvl == 0)
            break;

        DL_MCAN_readMsgRam(can.reg, DL_MCAN_MEM_TYPE_FIFO, 0, rf.num, &rxbuf->canrx);
        DL_MCAN_writeRxFIFOAck(can.reg, rf.num, rf.getIdx);

        /*** forward to ModbusTCP *********/

//        uart.nputs(ARRANDN("CAN rx: " ));
//        uart.nputs(ARRANDN(NEWLINE "dump: "));
//        for(uint8_t j = 0; j < System::CANFD::DLC2Len(&rxbuf->canrx); j++){
//            if(j % 10 == 0)
//                uart.nputs(ARRANDN(NEWLINE));
//
//            uart.nputs(ARRANDN(" "));
//            uart.putu32h(rxbuf->canrx.data[j]);
//        }
//        uart.nputs(ARRANDN(NEWLINE));

        Networking::Bridge::CANModbus::Meta_t meta;
        if(CAN_to_ModbusTCP(&rxbuf->canrx, &txbuf->mbap, &meta)) {
            send(meta.socket, txbuf->arr, sizeof(MBAPHeader) + ntoh16(txbuf->mbap.len));
//            uart.nputs(ARRANDN("forwarded to ModbusTCP" NEWLINE));
        } else {
//            uart.nputs(ARRANDN("not forwarded to ModbusTCP" NEWLINE));
        }

        // already bad
//                    uart.nputs(ARRANDN("dump: "));
//                    for(uint8_t j = 0; j < sizeof(MBAPHeader) + ntoh16(txbuf.mbap.len); j++){
//                        if(j % 10 == 0)
//                            uart.nputs(ARRANDN(NEWLINE));
//
//                        uart.nputs(ARRANDN(" "));
//                        uart.putu32h(txbuf.arr[j]);
//                    }
//                    uart.nputs(ARRANDN(NEWLINE));

        DL_MCAN_getRxFIFOStatus(can.reg, &rf);

    }

    can.giveResource();
}

bool forwardModbusTCP2CAN(_RXBuffer const * rx, _TXBuffer * buf, uint8_t socket) {
    // NOTE: resource LOCKS CAN

    using namespace Networking::Bridge::CANModbus;
    using namespace Networking::Modbus;
    using namespace Networking::CAN;

    MBAPHeader const * rxheader = reinterpret_cast<MBAPHeader const *>(rx->arr);

    /*** forward ModbusTCP to CAN *************/

    {
        auto id = reinterpret_cast<J1939::ID *>(&buf->cantx.id);

        buf->cantx = {
                .id     = 0,        // CAN id, 11b->[28:18], 29b->[] when using 11b can id
                .rtr    = 0,        // 0: data frame, 1: remote frame
                .xtd    = 1,        // 0: 11b id, 1: 29b id
                .esi    = 0,        // error state indicator, 0: passive flag, 1: transmission recessive
                .dlc    = 0,        // data byte count, see DL comments
                .brs    = 1,        // 0: no bit rate switching, 1: yes brs
                .fdf    = 1,        // FD format, 0: classic CAN, 1: CAN FD format
                .efc    = 0,        // 0: dont store Tx events, 1: store
                .mm     = 0,        // In order to track which transmit frame corresponds to which TX Event FIFO element, you can use the MM(Message Marker) bits in the transmit frame. The corresponding TX Event FIFO element will have the same message marker.
            };

        Networking::Bridge::CANModbus::Meta_t meta;
        meta.socket = socket;
        meta.initiatorID = rxheader->adu[0].unitID;
        if(!ModbusTCP_to_CAN(rxheader, &(buf->cantx), &meta)) {
            uart.nputs(ARRANDN("failed ModbusTCP_to_CAN" NEWLINE));
            return false;
        }

        // send CAN packet
        if(!can.takeResource(pdMS_TO_TICKS(50))) { // LOCK CAN
            uart.nputs(ARRANDN("CAN lock failed" NEWLINE));
            return false;
        }


//        {
//            uart.nputs(ARRANDN(NEWLINE " \t Sending CAN bus: "));
//
//            for(uint8_t j = 0; j < System::CANFD::DLC2Len(&buf->cantx); j++){
//                if(j % 10 == 0)
//                    uart.nputs(ARRANDN(NEWLINE " \t"));
//
//                uart.nputs(ARRANDN(" "));
//                uart.putu32h(buf->cantx.data[j]);
//            }
//            uart.nputs(ARRANDN(NEWLINE));
//        }

        DL_MCAN_TxFIFOStatus tf;

